{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "0",
   "metadata": {},
   "source": [
    "# Summary 5"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "3",
   "metadata": {},
   "source": [
    "### Разбор ДЗ 9"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4",
   "metadata": {},
   "source": [
    "1. Таблица умножения  \n",
    "Напишите программу, которая выводит таблицу умножения для чисел от 1 до n. Где n это число, которое введет пользователь.   Оформите вывод так, чтобы столбцы были ровные (число ровно под числом)  \n",
    "Пример вывода:\n",
    "```\n",
    "Введите число: 5  \n",
    "1\t2\t3\t4\t5\t  \n",
    "2\t4\t6\t8\t10\t  \n",
    "3\t6\t9\t12\t15\t  \n",
    "4\t8\t12\t16\t20\t  \n",
    "5\t10\t15\t20\t25\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5",
   "metadata": {},
   "outputs": [],
   "source": [
    "n = int(input())\n",
    "\n",
    "for i in range(1,n+1): #i - строка\n",
    "    for j in range(1,n+1):#j - столбцы\n",
    "        print(i*j, end='\\t')\n",
    "    print()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6",
   "metadata": {},
   "source": [
    "2. Лестница чисел\n",
    "Напишите программу, которая принимает число n и выводит \"лестницу\" из чисел. Каждая строка лестницы содержит числа от 1 до номера строки.\n",
    "```\n",
    "Пример вывода:\n",
    "Введите число: 5  \n",
    "1  \n",
    "1 2  \n",
    "1 2 3  \n",
    "1 2 3 4  \n",
    "1 2 3 4 5\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7",
   "metadata": {},
   "outputs": [],
   "source": [
    "n = int(input())\n",
    "\n",
    "for i in range(1,n+1): #i - строка\n",
    "    for j in range(1,i+1):#j - столбцы\n",
    "        print(j, end='\\t')\n",
    "    print()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8",
   "metadata": {},
   "source": [
    "3. Удаление всех повторяющихся символов  \n",
    "Напишите программу, которая принимает строку и удаляет из неё все повторяющиеся символы, сохраняя только первые их вхождения.\n",
    "Пример вывода:  \n",
    "Введите строку: Python programming   \n",
    "Результат: Python prgami  \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9",
   "metadata": {},
   "outputs": [],
   "source": [
    "text = input()\n",
    "\n",
    "res = ''\n",
    "\n",
    "for char in text:\n",
    "    if char not in res:\n",
    "        res+=char\n",
    "\n",
    "print(res)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "10",
   "metadata": {},
   "source": [
    "### ДЗ 10"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "11",
   "metadata": {},
   "source": [
    "1. Создание списка с пользовательскими данными\n",
    "Напишите программу, которая принимает список целых чисел от пользователя и добавляет каждое число в динамический массив. Программа должна принимать новое число от пользователя и добавлять его в динамический массив до тех пор, пока пользователь не введет команду \"Выход\". Выведите итоговый динамический массив на экран с помощью команды print.\n",
    "\n",
    "Пример вывода:  \n",
    "```\n",
    "Введите число или 'выход':: 1\n",
    "Введите число или 'выход':: 2\n",
    "Введите число или 'выход':: выход\n",
    "Итоговый динамический массив: [1, 2]\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "12",
   "metadata": {},
   "outputs": [],
   "source": [
    "res = []\n",
    "num = input()\n",
    "\n",
    "while num != 'выход':\n",
    "    res += [int(num)]\n",
    "    num = input()\n",
    "print(res)\n",
    "    "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "13",
   "metadata": {},
   "source": [
    "2. Квадрат нечетных чисел\n",
    "Напишите программу, которая изменяет изначальный список и возводит в квадрат только нечётные числа.\n",
    "numbers = [4, 9, 1, 7, 2, 5, 0, 3, 7, 1, 3]  \n",
    "Пример вывода:  \n",
    "Изначальный список: [4, 9, 1, 7, 2, 5, 0, 3, 7, 1, 3]  \n",
    "Измененный список:  [4, 81, 1, 49, 2, 25, 0, 9, 49, 1, 9]  \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "14",
   "metadata": {},
   "outputs": [],
   "source": [
    "numbers = [4, 9, 1, 7, 2, 5, 0, 3, 7, 1, 3]\n",
    "print('Изначальный список:',numbers)\n",
    "i = 0\n",
    "for item in numbers:\n",
    "    if item % 2 == 1:\n",
    "        numbers[i] = numbers[i] ** 2\n",
    "    i += 1\n",
    "print('Измененный список: ', numbers)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "15",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python (.venv)",
   "language": "python",
   "name": ".venv"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
