{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "0",
   "metadata": {},
   "source": [
    "# Summary 9"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "4",
   "metadata": {},
   "source": [
    "# Домашнее задание"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5",
   "metadata": {},
   "source": [
    "### ДЗ 17"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6",
   "metadata": {},
   "source": [
    "1. ***Проверка на подмножество***  \n",
    "Напишите программу, которая проверяет, содержит ли первое множество все элементы второго множества. Реализуйте решение несколькими способами. Решите одним из способов не используя возможности множеств.\n",
    "Данные:  \n",
    "`set1 = {1, 2, 3, 4}`  \n",
    "`set2 = {2, 3}`  \n",
    "\n",
    "Пример вывода:  \n",
    "`True`\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Способ 1 (множества)\n",
    "set1 = {1, 2, 3, 4}\n",
    "set2 = {2, 3}\n",
    "\n",
    "print(set1 >= set2)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Способ 2 (множества)\n",
    "set1 = {1, 2, 3, 4}\n",
    "set2 = {2, 3}\n",
    "\n",
    "print(set1.issuperset(set2))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Способ 3 (множества)\n",
    "set1 = {1, 2, 3, 4}\n",
    "set2 = {2, 3}\n",
    "\n",
    "print(set2.issubset(set1))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "10",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Способ 4 (без множеств)\n",
    "set1 = {1, 2, 3, 4}\n",
    "set2 = {2, 3}\n",
    "\n",
    "is_subset = True\n",
    "for elem in set2:\n",
    "    if elem not in set1:\n",
    "        is_subset = False\n",
    "        break\n",
    "print(is_subset)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "11",
   "metadata": {},
   "source": [
    "2. ***Зеркальное подмножество***  \n",
    "Напишите программу, которая проверяет, являются ли элементы одного из множеств подмножеством другого. В случае положительного ответа возвращает разницу между двумя множествами. Проверить необходимо в обе стороны.  \n",
    "Данные:   \n",
    "`set1 = {2, 3, 4, 5, 6}`  \n",
    "`set2 = {4, 5}`  \n",
    "\n",
    "Пример вывода:  \n",
    "Подмножество: `True`  \n",
    "Разница: `{2, 3, 6}`\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "12",
   "metadata": {},
   "outputs": [],
   "source": [
    "set1 = {2, 3, 4, 5, 6}\n",
    "set2 = {4, 7}\n",
    "\n",
    "set1_super = set2.issubset(set1)\n",
    "set2_super = set1.issubset(set2)\n",
    "\n",
    "is_subset = set1_super or set2_super\n",
    "print('Подмножество:',is_subset)\n",
    "if is_subset:\n",
    "    if set1_super:\n",
    "        difference = set1 - set2\n",
    "        print('Разница: ', difference)\n",
    "    else:\n",
    "        difference = set2 - set1\n",
    "        print('Разница: ', difference)\n",
    "    "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "13",
   "metadata": {},
   "source": [
    "### ДЗ 18"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "14",
   "metadata": {},
   "source": [
    "1. ***Не уникальные числа***  \n",
    "Напишите программу, которая находит все числа, встречающиеся более одного раза в списке, и выводит их в порядке убывания.  \n",
    "Данные:  \n",
    "`numbers = [4, 7, 3, 7, 8, 3, 4, 2, 7, 3, 8, 4]`\n",
    "\n",
    "Пример вывода:  \n",
    "Числа, встречающиеся более одного раза: `[8, 7, 4, 3]`\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "15",
   "metadata": {},
   "outputs": [],
   "source": [
    "numbers = [4, 7, 3, 7, 8, 3, 4, 2, 7, 3, 8, 4]\n",
    "\n",
    "repeated_numbers = {n for n in numbers if numbers.count(n) > 1}\n",
    "\n",
    "sorted_repeated_numbers = sorted(repeated_numbers, reverse = True)\n",
    "\n",
    "print('Числа, встречающиеся более одного раза:', sorted_repeated_numbers)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "16",
   "metadata": {},
   "source": [
    "2. ***Проверка подмножества***  \n",
    "Напишите программу, которая проверяет, является ли один словарь подмножеством другого (т.е. все его пары \"ключ-значение\" содержатся в другом словаре).  \n",
    "*Данные:*  \n",
    "`dict1 = {\"a\": 1, \"b\": 2}`  \n",
    "`dict2 = {\"a\": 1, \"b\": 2, \"c\": 3}`  \n",
    "\n",
    "*Пример вывода:*  \n",
    "Первый словарь является подмножеством второго.  \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "17",
   "metadata": {},
   "outputs": [],
   "source": [
    "dict1 = {\"a\": 1, \"b\": 2}\n",
    "dict2 = {\"a\": 1, \"b\": 2, \"c\": 3}\n",
    "\n",
    "is_subset = True\n",
    "for key in dict1:\n",
    "    if key not in dict2 or dict1[key] != dict2[key]:\n",
    "        is_subset = False\n",
    "        break\n",
    "\n",
    "if is_subset:\n",
    "    print('Первый словарь является подмножеством второго.')\n",
    "\n",
    "is_subset = True\n",
    "for key in dict2:\n",
    "    if key not in dict1 or dict2[key] != dict1[key]:\n",
    "        is_subset = False\n",
    "        break\n",
    "\n",
    "if is_subset:\n",
    "    print('Второй словарь является подмножеством первого.')\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "18",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
