{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "0",
   "metadata": {},
   "source": [
    "# Summary 8"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "6",
   "metadata": {},
   "source": [
    "## ДЗ 15"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7",
   "metadata": {},
   "source": [
    "1. ***Одно слово***  \n",
    "Напишите программу, которая обрабатывает список из строк и удаляет все строки, содержащие более одного слова, а также преобразует оставшиеся строки к нижнему регистру.  \n",
    "Данные:  \n",
    "`text_list = [\"Hello\", \"Python Programming\", \"World\", \"Advanced Topics\", \"Simple\"]`  \n",
    "Пример вывода:  \n",
    "Обработанный список: `['hello', 'world', 'simple']`  \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8",
   "metadata": {},
   "outputs": [],
   "source": [
    "text_list = [\"Hello\", \"Python Programming\", \"World\", \"Advanced Topics\", \"Simple\"]\n",
    "\n",
    "for i in range(len(text_list) - 1, -1, -1):\n",
    "    if \" \" in text_list[i]:  # Проверка на наличие более одного слова\n",
    "        del text_list[i]\n",
    "    else:\n",
    "        text_list[i] = text_list[i].lower()  # Преобразование к нижнему регистру\n",
    "\n",
    "print(\"Обработанный список:\", text_list)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9",
   "metadata": {},
   "source": [
    "2. ***Обновление цен товаров***  \n",
    "Дан список товаров с ценами. Программа должна применить скидку к каждому товару и добавить в список элемент с новой ценой. В конце вывести таблицу с новой ценой.  \n",
    "Данные:  \n",
    "`products = [[\"Laptop\", 1200], [\"Mouse\", 25], [\"Keyboard\", 75], [\"Monitor\", 200]]`  \n",
    "\n",
    "Пример вывода:  \n",
    "Введите скидку (в процентах): 17  \n",
    "\n",
    "`Товар          Старая цена    Новая цена`  \n",
    "`Laptop            1200.00$       996.00$`  \n",
    "`Mouse               25.00$        20.75$`  \n",
    "`Keyboard            75.00$        62.25$`  \n",
    "`Monitor            200.00$       166.00$`  \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "10",
   "metadata": {},
   "outputs": [],
   "source": [
    "products = [[\"Laptop\", 1200], [\"Mouse\", 25], [\"Keyboard\", 75], [\"Monitor\", 200]]\n",
    "discount = int(input(\"Введите скидку (в процентах): \"))\n",
    "\n",
    "for product in products:\n",
    "    new_price = product[1] * (1 - discount / 100)\n",
    "    product.append(round(new_price, 2))\n",
    "print(f\"\\n{'Товар':<12}{'Старая цена':>14}{'Новая цена':>14}\")\n",
    "\n",
    "for name, price, new_price in products:\n",
    "    print(f\"{name:<12}{price:>13.2f}${new_price:>13.2f}$\")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "11",
   "metadata": {},
   "source": [
    "## ДЗ 16"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "12",
   "metadata": {},
   "source": [
    "1. ***Фильтрация по символу***  \n",
    "Из заданного списка строк создайте новый список, исключив все строки, содержащие символ, который введет пользователь.  \n",
    "Данные:  \n",
    "`words = [\"apple\", \"cherry\", \"kiwi\", \"banana\", \"orange\"]`  \n",
    "\n",
    "Пример вывода:  \n",
    "Исключить символ: r  \n",
    "`['apple', 'kiwi', 'banana']`\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "13",
   "metadata": {},
   "outputs": [],
   "source": [
    "words = [\"apple\", \"cherry\", \"kiwi\", \"banana\", \"orange\"]\n",
    "char = input(\"Исключить символ: \")\n",
    "filtered_words = [word for word in words if char not in word]\n",
    "print(filtered_words)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "14",
   "metadata": {},
   "source": [
    "2. ***Правильные скобки***  \n",
    "Что нужно сделать:  \n",
    "Напишите программу, которая принимает строку, содержащую любые виды скобок — круглые (), квадратные [] и фигурные {}.  \n",
    "Необходимо проверить, правильно ли они расставлены. Скобки считаются правильно расставленными, если:  \n",
    "Каждая открывающая скобка имеет соответствующую закрывающую.  \n",
    "Скобки закрываются в правильном порядке.   \n",
    "Пример данных:   \n",
    "`string = \"({[}])\"`  \n",
    "\n",
    "Пример вывода:  \n",
    "Скобки: `({[}])`  \n",
    "Валидны: `False`  \n",
    "\n",
    "Скобки: `([({}()){}])`  \n",
    "Валидны: `True`\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "15",
   "metadata": {},
   "outputs": [],
   "source": [
    "string = \"([({}()){}])\"\n",
    "stack = []\n",
    "brackets = '(){}[]'\n",
    "is_valid = True # флаг для последовательности\n",
    "\n",
    "# print(brackets[::2]) открывающиеся скобки\n",
    "# print(brackets[1::2]) закрывающиеся скобки\n",
    "for bracket in string:\n",
    "    if bracket in brackets[::2]:\n",
    "        stack.append(bracket)\n",
    "    elif bracket in brackets[1::2]: #если скобка закрывающаяся\n",
    "        if stack != [] and stack[-1] == brackets[brackets.find(bracket) - 1]: # если есть пара у скобки\n",
    "            stack.pop()\n",
    "        else:\n",
    "            is_valid = False\n",
    "            break\n",
    "print(f'Скобки: {string}')\n",
    "print('Валидны:', is_valid)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "16",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "17",
   "metadata": {},
   "outputs": [],
   "source": [
    "string = list(\"([({}())}{}])\")\n",
    "\n",
    "i = 0\n",
    "while i < len(string):\n",
    "    if string[i] == '(' and string[i+1]==')' or string[i] == '{' and string[i+1]=='}' or string[i] == '[' and string[i+1]==']':\n",
    "        del string[i]\n",
    "        del string[i]\n",
    "        i = 0\n",
    "    else:\n",
    "        i+=1\n",
    "if string:\n",
    "    print(False)\n",
    "else:\n",
    "    print(True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "18",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "19",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "20",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "21",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "22",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
