{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "0",
   "metadata": {},
   "source": [
    "# 1. Прогрессия увеличения\n",
    "\n",
    "Напишите программу, которая создаёт новый кортеж, состоящий из элементов изначального в том же порядке. Добавить в него только элементы, которые больше всех предыдущих значений в исходном кортеже.\n",
    "\n",
    "Данные:\n",
    "\n",
    "numbers = (3, 7, 2, 8, 5, 10, 1)\n",
    "\n",
    "Пример вывода:\n",
    "\n",
    "Кортеж по возрастанию: (3, 7, 8, 10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1",
   "metadata": {},
   "outputs": [],
   "source": [
    "numbers = (3, 7, 2, 8, 5, 10, 1)\n",
    "result = [numbers[0]]\n",
    "for item in numbers[1:]:\n",
    "    if item > result[-1]:\n",
    "        result += [item]\n",
    "print(tuple(result))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2",
   "metadata": {},
   "source": [
    "# 2. Длины слов в предложении\n",
    "\n",
    "Напишите программу, которая принимает строку от пользователя и разбивает ее на отдельные слова. Затем программа должна создать новый кортеж, содержащий длину каждого слова в исходной строке. Используйте методы строк и кортежей для обработки данных.\n",
    "\n",
    "Пример вывода:\n",
    "\n",
    "Введите предложение: Программирование это интересно и полезно\n",
    "\n",
    "Длины слов в предложении: (16, 3, 9, 1, 7)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3",
   "metadata": {},
   "outputs": [],
   "source": [
    "str_user = input('Введите предложение:')\n",
    "len_item = []\n",
    "for item in str_user.split():\n",
    "    len_item += [len(item)]\n",
    "print(tuple(len_item))"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python (.venv)",
   "language": "python",
   "name": ".venv"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
