{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "0",
   "metadata": {},
   "source": [
    "#### 1. Неуникальные числа\n",
    "Напишите программу, которая находит все числа, встречающиеся более одного раза в списке, и выводит их в порядке убывания.\n",
    "Данные:\n",
    "* numbers = [4, 7, 3, 7, 8, 3, 4, 2, 7, 3, 8, 4]\n",
    "\n",
    "Пример вывода:\n",
    "* Числа, встречающиеся более одного раза: [7, 4, 3, 8]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1",
   "metadata": {},
   "outputs": [],
   "source": [
    "numbers = [4, 7, 3, 7, 8, 3, 4, 2, 7, 3, 8, 4]\n",
    "\n",
    "not_unic = {n for n in numbers if numbers.count(n) > 1}\n",
    "\n",
    "sorted_rev_not_unic = sorted(not_unic, reverse = True)\n",
    "\n",
    "print('Числа, встречающиеся более одного раза:', sorted_rev_not_unic)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python (.venv)",
   "language": "python",
   "name": ".venv"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
