{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "0",
   "metadata": {},
   "source": [
    "### 1. Проверка кодировки\n",
    "\n",
    "Напишите программу, которая принимает от пользователя один символ и выводит его код в таблице Unicode и его принадлежность к диапазону ASCII (True/False).\n",
    "\n",
    "Пример вывода:\n",
    "Введите символ: A  \n",
    "Код Unicode: 65  \n",
    "ASCII символ: True"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1",
   "metadata": {},
   "outputs": [],
   "source": [
    "code = ord(str(input('Введите символ:')))\n",
    "print('Код Unicode:', code,'\\nASCII символ:', 0 <= code <= 127 )"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2",
   "metadata": {},
   "source": [
    "### 2. Подстрока с заполнением\n",
    "\n",
    "Напишите программу, которая принимает строку и индексы начала и конца. Программа должна вывести подстроку на указанных позициях. Также если конечный индекс выходит за пределы строки, программа заполняет недостающие символы символами _.\n",
    "\n",
    "Пример вывода:\n",
    "Введите строку: Программирование  \n",
    "Введите начальный индекс: 3  \n",
    "Введите конечный индекс: 20\n",
    "Подстрока: граммирование_____"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3",
   "metadata": {},
   "outputs": [],
   "source": [
    "str1 = str(input('Введите строку:'))\n",
    "s = int(input('Введите начальный индекс:'))\n",
    "f = int(input('Введите конечный индекс:'))\n",
    "if f  > len(str1):\n",
    "    print(str1[s:] + '_' * (f - len(str1)))\n",
    "else: \n",
    "    print(str1[s:f])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4",
   "metadata": {},
   "source": [
    "### 3. Подсчёт символа\n",
    "\n",
    "Напишите программу, которая принимает строку и символ, а затем подсчитывает, сколько раз символ встречается в строке.\n",
    "\n",
    "Пример вывода:\n",
    "Введите строку: Hello, world!  \n",
    "Введите символ: o  \n",
    "Символ o встречается 2 раз(а)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5",
   "metadata": {},
   "outputs": [],
   "source": [
    "str1 = input('Введите строку: ')\n",
    "ch = input('Введите символ: ')\n",
    "cnt = 0\n",
    "i = 0\n",
    "while i < len(str1):\n",
    "    if str1[i] == ch:\n",
    "        cnt += 1\n",
    "    i += 1\n",
    "print('Символ ' + ch + ' встречается ' + str(cnt) + ' раз(а).')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6",
   "metadata": {},
   "source": [
    "### 4. Инвертирование строки без цифр\n",
    "\n",
    "Напишите программу, которая принимает строку и выводит её в обратном порядке, пропуская все цифры.\n",
    "\n",
    "Пример вывода:\n",
    "Введите строку: n52uFs6Inoh67ty8P\n",
    "Результат: PythonIsFun"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7",
   "metadata": {},
   "outputs": [],
   "source": [
    "str1 = input('Введите строку: ')\n",
    "res = ''\n",
    "i = len(str1) - 1\n",
    "while i >= 0:\n",
    "    ch = str1[i]\n",
    "    if not (ch >= '0' and ch <= '9'):\n",
    "        res += ch\n",
    "    i -= 1\n",
    "print('Результат: ' + res)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
