{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "c6d488cc",
   "metadata": {},
   "source": [
    "### 1. Сумма цифр числа\n",
    "Напишите программу, которая вычисляет сумму цифр введённого числа.\n",
    "Подсказка: последнюю цифру числа можно найти с помощью остатка от деления на 10 (num % 10), а удалить ее из числа можно с помощью деления на 10 нацело (num // 10).\n",
    "\n",
    "Пример вывода:\n",
    "* Введите число: 12345\n",
    "* Сумма цифр: 15"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "63708039",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Сумма цифр: 15\n"
     ]
    }
   ],
   "source": [
    "num = int(input('Введите число:'))\n",
    "s = 0\n",
    "while num > 0:\n",
    "    d = num % 10\n",
    "    num = num // 10\n",
    "    s += d\n",
    "print('Сумма цифр:', s)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a067342f",
   "metadata": {},
   "source": [
    "### 2. Палиндром\n",
    "\n",
    "Напишите программу, которая запрашивает у пользователя целое число и определяет, является ли оно палиндромом. Число является палиндромом, если оно читается одинаково слева направо и справа налево.\n",
    "\n",
    "Пример вывода:\n",
    "\n",
    "* Введите число: 12321\n",
    "* Число 12321 является палиндромом.\n",
    "\n",
    "* Введите число: 1234\n",
    "* Число 1234 не является палиндромом."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "6015e7b7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Число  1234 не является палиндромом.\n"
     ]
    }
   ],
   "source": [
    "user_num = abs(int(input('Введите число:')))\n",
    "num = user_num\n",
    "revers = 0\n",
    "while num > 0:\n",
    "    d = num % 10\n",
    "    num = num // 10\n",
    "    revers = revers * 10 + d\n",
    "if user_num == revers:\n",
    "    print('Число ', user_num, 'является палиндромом.')\n",
    "else:\n",
    "    print('Число ', user_num, 'не является палиндромом.')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "53472d40",
   "metadata": {},
   "source": [
    "### 3. Проверь интуицию\n",
    "\n",
    "Напишите программу, которая генерирует случайное число от 1 до 100 включительно и дает пользователю 10 попыток, чтобы угадать это число. Программа должна подсказывать, больше или меньше загаданное число. После завершения игры программа оценивает, насколько хорошая интуиция у игрока.\n",
    "\n",
    "Пример вывода:\n",
    "\n",
    "* Угадайте число от 1 до 100. У вас 10 попыток.\n",
    "* Ваше предположение: 50\n",
    "* Загаданное число меньше вашего\n",
    "* Ваше предположение: 25\n",
    "* Загаданное число больше вашего\n",
    "* Ваше предположение: 30\n",
    "Поздравляем! Вы угадали число: 30.\n",
    "\n",
    "Вы угадали число за 3 попытки. Отличный результат!\n",
    "\n",
    "* Угадайте число от 1 до 100. У вас 10 попыток.\n",
    "* Ваше предположение: 2\n",
    "Поздравляем! Вы угадали число: 2 за 1 попыток. Отличный результат!\n",
    "Отличная интуиция! Вы угадали с первой попытки!\n",
    "print(rnd_num)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "0da4a70a",
   "metadata": {},
   "outputs": [
    {
     "ename": "TypeError",
     "evalue": "Kernel.raw_input() takes from 1 to 2 positional arguments but 3 were given",
     "output_type": "error",
     "traceback": [
      "\u001b[31m---------------------------------------------------------------------------\u001b[39m",
      "\u001b[31mTypeError\u001b[39m                                 Traceback (most recent call last)",
      "\u001b[36mCell\u001b[39m\u001b[36m \u001b[39m\u001b[32mIn[39]\u001b[39m\u001b[32m, line 8\u001b[39m\n\u001b[32m      6\u001b[39m count +=\u001b[32m1\u001b[39m\n\u001b[32m      7\u001b[39m x = \u001b[32m10\u001b[39m - count  \n\u001b[32m----> \u001b[39m\u001b[32m8\u001b[39m user_num = \u001b[38;5;28mabs\u001b[39m(\u001b[38;5;28mint\u001b[39m(\u001b[38;5;28;43minput\u001b[39;49m\u001b[43m(\u001b[49m\u001b[33;43m'\u001b[39;49m\u001b[33;43mУгадайте число от 1 до 100. У вас осталось попыток\u001b[39;49m\u001b[33;43m'\u001b[39;49m\u001b[43m,\u001b[49m\u001b[43mx\u001b[49m\u001b[43m)\u001b[49m))\n\u001b[32m      9\u001b[39m \u001b[38;5;28;01mif\u001b[39;00m user_num == rnd_num:\n\u001b[32m     10\u001b[39m     \u001b[38;5;28mprint\u001b[39m(\u001b[33m'\u001b[39m\u001b[33mВаше предположение:\u001b[39m\u001b[33m'\u001b[39m, user_num, \u001b[33m'\u001b[39m\u001b[38;5;130;01m\\n\u001b[39;00m\u001b[33m Поздравляем! Вы угадали число:\u001b[39m\u001b[33m'\u001b[39m, rnd_num,\u001b[33m'\u001b[39m\u001b[38;5;130;01m\\n\u001b[39;00m\u001b[33m Вы угадали число за\u001b[39m\u001b[33m'\u001b[39m, count , \u001b[33m'\u001b[39m\u001b[33mпопытки. Отличный результат!\u001b[39m\u001b[38;5;130;01m\\n\u001b[39;00m\u001b[33m Отличная интуиция! Вы угадали с\u001b[39m\u001b[33m'\u001b[39m, count, \u001b[33m'\u001b[39m\u001b[33mпопытки!\u001b[39m\u001b[33m'\u001b[39m)\n",
      "\u001b[31mTypeError\u001b[39m: Kernel.raw_input() takes from 1 to 2 positional arguments but 3 were given"
     ]
    }
   ],
   "source": [
    "import random\n",
    "count = 0\n",
    "rnd_num = random.randint(1, 100)\n",
    "while count < 10:\n",
    "    \n",
    "    count +=1\n",
    "    x = 10 - count  \n",
    "    user_num = abs(int(input('Угадайте число от 1 до 100. У вас осталось попыток',x)))\n",
    "    if user_num == rnd_num:\n",
    "        print('Ваше предположение:', user_num, '\\n Поздравляем! Вы угадали число:', rnd_num,'\\n Вы угадали число за', count , 'попытки. Отличный результат!\\n Отличная интуиция! Вы угадали с', count, 'попытки!')\n",
    "        break  # Прерывание цикла\n",
    "    if user_num > rnd_num:\n",
    "        print('Ваше предположение:', user_num,'\\n' , 'Загаданное число меньше вашего')\n",
    "    else:\n",
    "        print('Ваше предположение:', user_num,'\\n' , 'Загаданное число больше вашего')\n",
    "else:\n",
    "    print('Вы использовали все', count,'попыток.\\n Загаданное число -', rnd_num)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.11"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
