{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "0",
   "metadata": {},
   "source": [
    "#### 1. Неуникальные числа\n",
    "Напишите программу, которая находит все числа, встречающиеся более одного раза в списке, и выводит их в порядке убывания.\n",
    "Данные:\n",
    "* numbers = [4, 7, 3, 7, 8, 3, 4, 2, 7, 3, 8, 4]\n",
    "\n",
    "Пример вывода:\n",
    "* Числа, встречающиеся более одного раза: [7, 4, 3, 8]"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1",
   "metadata": {},
   "source": [
    "##### 1 способ"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2",
   "metadata": {},
   "outputs": [],
   "source": [
    "numbers = [4, 7, 3, 7, 8, 3, 4, 2, 7, 3, 8, 4]\n",
    "\n",
    "not_unic = {n for n in numbers if numbers.count(n) > 1}\n",
    "print('Числа, встречающиеся более одного раза:', sorted(not_unic, reverse = True))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3",
   "metadata": {},
   "source": [
    "##### 2 способ"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4",
   "metadata": {},
   "outputs": [],
   "source": [
    "numbers = [4, 7, 3, 7, 8, 3, 4, 2, 7, 3, 8, 4]\n",
    "counts = {}\n",
    "\n",
    "for n in numbers:\n",
    "    counts[n] = counts.setdefault(n, 0) + 1\n",
    "not_unic = [n for n, count in counts.items() if count > 1]\n",
    "print('Числа, встречающиеся более одного раза:', sorted(not_unic, reverse=True))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5",
   "metadata": {},
   "source": [
    "#### 2. Проверка подмножества\n",
    "Напишите программу, которая проверяет, является ли один словарь подмножеством другого (т.е. все его пары \"ключ-значение\" содержатся в другом словаре).\n",
    "\n",
    "Данные:\n",
    "\n",
    "`dict1 = {\"a\": 1, \"b\": 2}`\n",
    "\n",
    "`dict2 = {\"a\": 1, \"b\": 2, \"c\": 3}`\n",
    "\n",
    "\n",
    "Пример вывода:\n",
    "\n",
    "Первый словарь является подмножеством второго."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6",
   "metadata": {},
   "source": [
    "##### 1 способ"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7",
   "metadata": {},
   "outputs": [],
   "source": [
    "dict2 = {\"a\": 1, \"b\": 2}\n",
    "dict1 = {\"a\": 1, \"b\": 2, \"c\": 3}\n",
    "\n",
    "is_subset = True\n",
    "for key in dict1:\n",
    "    if key not in dict2 or dict1[key] != dict2[key]:\n",
    "        is_subset = False\n",
    "        break\n",
    "if is_subset:\n",
    "    print('Первый словарь является подмножеством второго')\n",
    "\n",
    "is_subset = True\n",
    "for key in dict2:\n",
    "    if key not in dict1 or dict2[key] != dict1[key]:\n",
    "        is_subset = False\n",
    "        break\n",
    "if is_subset:\n",
    "    print('Второй словарь является подмножеством первого')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8",
   "metadata": {},
   "source": [
    "##### 2 способ"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9",
   "metadata": {},
   "outputs": [],
   "source": [
    "dict2 = {\"a\": 1, \"b\": 2}\n",
    "dict1 = {\"a\": 1, \"b\": 2, \"c\": 3}\n",
    "\n",
    "if set(dict1.items()) <= set(dict2.items()):\n",
    "    print('Первый словарь является подмножеством второго.')\n",
    "\n",
    "elif set(dict1.items()) >= set(dict2.items()):\n",
    "    print('Второй словарь является подмножеством первого.')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
