{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "0",
   "metadata": {},
   "source": [
    "1. Фильтрация по символу\n",
    "\n",
    "Из заданного списка строк создайте новый список, исключив все строки, содержащие символ, который введет пользователь.\n",
    "\n",
    "***Данные:***\n",
    "\n",
    "`words = [\"apple\", \"cherry\", \"kiwi\", \"banana\", \"orange\"]`\n",
    "\n",
    "***Пример вывода:***\n",
    "\n",
    "Исключить символ: r\n",
    "\n",
    "`['apple', 'kiwi', 'banana']`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1",
   "metadata": {},
   "outputs": [],
   "source": [
    "words = [\"apple\", \"cherry\", \"kiwi\", \"banana\", \"orange\"]\n",
    "a = input('Исключить символ:')\n",
    "print([word for word in words if a not in word])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2",
   "metadata": {},
   "source": [
    "2. Правильные скобки\n",
    "\n",
    "Что нужно сделать:\n",
    "Напишите программу, которая принимает строку, содержащую любые виды скобок — круглые (), квадратные [] и фигурные {}.\n",
    "Необходимо проверить, правильно ли они расставлены. Скобки считаются правильно расставленными, если:\n",
    "\n",
    "* Каждая открывающая скобка имеет соответствующую закрывающую.\n",
    "* Скобки закрываются в правильном порядке.\n",
    "\n",
    "***Пример данных:***\n",
    "string = \"({[}])\"\n",
    "\n",
    "***Пример вывода:***\n",
    "Скобки: ({[}])\n",
    "\n",
    "Валидны: False\n",
    "\n",
    "Скобки: ([({}()){}])\n",
    "\n",
    "Валидны: True"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3",
   "metadata": {},
   "outputs": [],
   "source": [
    "string = \"([({}()){}])\"\n",
    "stack = []\n",
    "brackets = '(){}[]'\n",
    "valid = True\n",
    "for bracket in string:\n",
    "    if bracket in brackets[::2]:\n",
    "        stack.append(bracket)\n",
    "    elif bracket in brackets[1::2]:\n",
    "        if stack and stack[-1] == brackets[brackets.find(bracket) - 1]:\n",
    "            stack.pop()\n",
    "        else:\n",
    "            valid = False\n",
    "            break\n",
    "print(f\"Скобки:{string}\")\n",
    "print(f\"Валидны:{valid}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4",
   "metadata": {},
   "outputs": [],
   "source": [
    "string = \"({[}])\"\n",
    "lst_str = list(string)\n",
    "i = 0\n",
    "while i < len(lst_str):\n",
    "    if lst_str[i] == '(' and lst_str[i+1] == ')' or lst_str[i] == '{' and lst_str[i+1] == '}' or lst_str[i] == '[' and lst_str[i+1] == ']':\n",
    "        del lst_str[i]\n",
    "        del lst_str[i]\n",
    "        i = 0\n",
    "    else:\n",
    "        i += 1\n",
    "if lst_str:\n",
    "    print(f\"Скобки:{string}\")\n",
    "    print(False)\n",
    "else:\n",
    "    print(f\"Скобки:{string}\")\n",
    "    print(True)\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
