{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "a6f4b21a",
   "metadata": {},
   "source": [
    "### 1. Таблица умножения\n",
    "Напишите программу, которая выводит таблицу умножения для чисел от 1 до n. Где n это число, которое введет пользователь. Оформите вывод так, чтобы столбцы были ровные (число ровно под числом)\n",
    "\n",
    "Пример вывода:\n",
    "\n",
    "Введите число: 5"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "ede8ece5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1  2  3  4  5            \n",
      "2  4  6  8  10           \n",
      "3  6  9  12 15           \n",
      "4  8  12 16 20           \n",
      "5  10 15 20 25           \n"
     ]
    }
   ],
   "source": [
    "n = int(input('введите число:'))\n",
    "rows = range(1, n+1)\n",
    "cols = range(1, n+1)\n",
    "\n",
    "for i in rows:\n",
    "    for j in cols:\n",
    "        if (i * j) < 10:\n",
    "            print(i * j, ' ', end = \"\")\n",
    "        else:\n",
    "            print(i * j, end = \" \")\n",
    "    print(' ' * 10)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c761071b",
   "metadata": {},
   "source": [
    "### 2. Лестница чисел\n",
    "\n",
    "Напишите программу, которая принимает число n и выводит \"лестницу\" из чисел. Каждая строка лестницы содержит числа от 1 до номера строки.\n",
    "\n",
    "Пример вывода:\n",
    "\n",
    "Введите число: 5"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "7c202100",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1           \n",
      "1 2           \n",
      "1 2 3           \n",
      "1 2 3 4           \n",
      "1 2 3 4 5           \n"
     ]
    }
   ],
   "source": [
    "n = int(input('введите число:'))\n",
    "for i in range(1, n + 1):\n",
    "    for j in range(1, n + 1):\n",
    "        if j == i + 1:\n",
    "            break\n",
    "        print(1 * j, end = \" \")\n",
    "    print(' ' * 10)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2fb92cf1",
   "metadata": {},
   "source": [
    "### 3. Удаление всех повторяющихся символов\n",
    "\n",
    "Напишите программу, которая принимает строку и удаляет из неё все повторяющиеся символы, сохраняя только первые их вхождения.\n",
    "\n",
    "Пример вывода:\n",
    "\n",
    "Введите строку: Python programming  \n",
    "\n",
    "Результат: Python prgami"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "a5fbe305",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Python prgami\n"
     ]
    }
   ],
   "source": [
    "letter = str(input('Введите строку:'))\n",
    "result = \"\"\n",
    "for ch  in letter:\n",
    "    if ch in result:\n",
    "        continue\n",
    "    result += ch\n",
    "print(result)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
