{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "0",
   "metadata": {},
   "source": [
    "### 1. Создание списка с пользовательскими данными\n",
    "\n",
    "Напишите программу, которая принимает список целых чисел от пользователя и добавляет каждое число в динамический массив. Программа должна принимать новое число от пользователя и добавлять его в динамический массив до тех пор, пока пользователь не введет команду \"Выход\". Выведите итоговый динамический массив на экран с помощью команды print.\n",
    "\n",
    "Пример вывода:\n",
    "\n",
    "Введите число или 'выход':: 1\n",
    "\n",
    "Введите число или 'выход':: 2\n",
    "\n",
    "Введите число или 'выход':: выход\n",
    "\n",
    "Итоговый динамический массив: [1, 2]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Итоговый динамический массив: [1, 2, 3, 4]\n"
     ]
    }
   ],
   "source": [
    "numbers = []\n",
    "while True:\n",
    "    user_input = input(\"Введите число или 'выход':: \")\n",
    "    if user_input == \"выход\":\n",
    "        break\n",
    "    number = int(user_input)\n",
    "    numbers += [number]\n",
    "print(\"Итоговый динамический массив:\", numbers)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2",
   "metadata": {},
   "source": [
    "### 2. Квадрат нечетных чисел\n",
    "\n",
    "Напишите программу, которая изменяет изначальный список и возводит в квадрат только нечётные числа.\n",
    "\n",
    "numbers = [4, 9, 1, 7, 2, 5, 0, 3, 7, 1, 3]\n",
    "\n",
    "Пример вывода:\n",
    "\n",
    "Изначальный список: [4, 9, 1, 7, 2, 5, 0, 3, 7, 1, 3]\n",
    "\n",
    "Измененный список:  [4, 81, 1, 49, 2, 25, 0, 9, 49, 1, 9]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "fec51088",
   "metadata": {},
   "outputs": [],
   "source": [
    "numbers = [4, 9, 1, 7, 2, 5, 0, 3, 7, 1, 3]\n",
    "\n",
    "for n in number:\n",
    "    \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "99ce74af",
   "metadata": {},
   "outputs": [],
   "source": [
    "numbers = [4, 9, 1, 7, 2, 5, 0, 3, 7, 1, 3]\n",
    "print('Изначальный список:',numbers)\n",
    "i = 0\n",
    "for item in numbers:\n",
    "    if item % 2 == 1:\n",
    "        numbers[i] = numbers[i] ** 2\n",
    "    i += 1\n",
    "print('Измененный список: ', numbers)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python (.venv)",
   "language": "python",
   "name": ".venv"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
