{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "0",
   "metadata": {},
   "source": [
    "# 1. Сумма положительных чисел\n",
    "\n",
    "Напишите программу, которая обрабатывает список float чисел, вычисляет сумму положительных чисел.\n",
    "Результат необходимо вывести в формате денежной суммы (до 2 символов после запятой), добавляя символ валюты \"$\" вначале\n",
    "и разделяя тысячи запятой.\n",
    "\n",
    "- Данные:\n",
    "<p>numbers = [1245.4435, -302.1403, 87459.99, -520.8265, 1450.001]\n",
    "\n",
    "- Пример вывода:\n",
    "<p>Сумма положительных чисел: $90,155.43"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1",
   "metadata": {},
   "outputs": [],
   "source": [
    "numbers = [1245.4435, -302.1403, 87459.99, -520.8265, 1450.001]\n",
    "positive_sum = 0\n",
    "for num in numbers:\n",
    "    if num > 0:\n",
    "        positive_sum += num\n",
    "formatted_sum = \"${:,.2f}\".format(positive_sum)\n",
    "print(f\"Сумма положительных чисел: {formatted_sum}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2",
   "metadata": {},
   "source": [
    "# 2. Счета клиентов\n",
    "\n",
    "Напишите программу, которая принимает список строк в формате \"name age balance\" и выводит информацию о каждом человеке с отформатированными данными: имя — 10 символов, возраст — 3 символа, баланс — 10 символов с двумя знаками после запятой. \n",
    "Используйте заранее подготовленный список строк.\n",
    "\n",
    "Данные:\n",
    "\n",
    "data_list = [\n",
    " \"John 23 12345.678\",\n",
    " \"Alice 30 200.50\",\n",
    " \"Bob 35 15000.3\",\n",
    " \"Charlie 40 500.75\"\n",
    "]\n",
    "\n",
    "Пример вывода:\n",
    "\n",
    "<p>Имя: John | Возраст: 23 | Баланс: 12345.68\n",
    "<p>Имя: Alice | Возраст: 30 | Баланс: 200.50\n",
    "<p>Имя: Bob | Возраст: 35 | Баланс: 15000.30\n",
    "<p>Имя: Charlie | Возраст: 40 | Баланс: 500.75\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3",
   "metadata": {},
   "outputs": [],
   "source": [
    "data_list = [\n",
    "    \"John 23 12345.678\",\n",
    "    \"Alice 30 200.50\",\n",
    "    \"Bob 35 15000.3\",\n",
    "    \"Charlie 40 500.75\"\n",
    "]\n",
    "\n",
    "for item in data_list:\n",
    "    name, age, balance = item.split()\n",
    "    format_name = f\"{name:<10}\"\n",
    "    format_age = f\"{int(age):>3}\"\n",
    "    format_balance = f\"{float(balance):>10.2f}\"\n",
    "    print(f\"Имя: {format_name} | Возраст: {format_age} | Баланс: {format_balance}\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python (.venv)",
   "language": "python",
   "name": ".venv"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
