{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "0",
   "metadata": {},
   "source": [
    "# 1. Буква в начале, цифра в конце\n",
    "\n",
    "Напишите программу, которая создает новый список. В него необходимо добавить только те строки из исходного списка, которые начинаются с буквы, а заканчиваются цифрой.\n",
    "\n",
    "Данные:\n",
    "\n",
    "strings = [\"apple23\", \"ban1ana45\", \"12cherry\", \"grape3\", \"blue23berry\"]\n",
    "\n",
    "Пример вывода:\n",
    "\n",
    "Строки с буквами в начале, цифрами в конце: ['apple23', 'ban1ana45', 'grape3']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1",
   "metadata": {},
   "outputs": [],
   "source": [
    "strings = [\"apple23\", \"ban1ana45\", \"12cherry\", \"grape3\", \"blue23berry\"]\n",
    "alfa_digit = []\n",
    "for item in strings:\n",
    "    if item[0].isalpha() and item[-1].isnumeric():\n",
    "        alfa_digit.append(item)\n",
    "print('Строки с буквами в начале, цифрами в конце:', alfa_digit)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2",
   "metadata": {},
   "source": [
    "# 2. Удаление кратных\n",
    "\n",
    "Напишите программу, которая удаляет из списка все значения, кратные числу, которое вводится пользователем.\n",
    "\n",
    "Данные:\n",
    "\n",
    "numbers = [1, 3, 6, 9, 10, 12, 15, 19, 20]\n",
    "\n",
    "Пример вывода:\n",
    "\n",
    "Введите число для удаления кратных ему элементов: 3\n",
    "\n",
    "Список без кратных значений: [1, 10, 19, 20]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3",
   "metadata": {},
   "outputs": [],
   "source": [
    "numbers = [1, 3, 6, 9, 10, 12, 15, 19, 20]\n",
    "divider = int(input('Введите число для удаления кратных ему элементов:'))\n",
    "for i in range(len(numbers) - 1, -1, -1):\n",
    "    if numbers[i] % divider == 0:\n",
    "        numbers.pop(i)\n",
    "print('Список без кратных значений:', numbers)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python (.venv)",
   "language": "python",
   "name": ".venv"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
