{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "0",
   "metadata": {},
   "source": [
    "1. Одно слово\n",
    "\n",
    "Напишите программу, которая обрабатывает список из строк и удаляет все строки, содержащие более одного слова, а также преобразует оставшиеся строки к нижнему регистру.\n",
    "\n",
    "***Данные:***\n",
    "\n",
    "text_list = [\"Hello\", \"Python Programming\", \"World\", \"Advanced Topics\", \"Simple\"]\n",
    "\n",
    "***Пример вывода:***\n",
    "\n",
    "Обработанный список: ['hello', 'world', 'simple']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1",
   "metadata": {},
   "outputs": [],
   "source": [
    "text_list = [\"Hello\", \"Python Programming\", \"World\", \"Advanced Topics\", \"Simple\"]\n",
    "result = []\n",
    "for item in text_list:\n",
    "    if \" \" not in item:\n",
    "        result.append(item.lower())\n",
    "print(result)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2",
   "metadata": {},
   "source": [
    "2. Обновление цен товаров\n",
    "\n",
    "Дан список товаров с ценами. Программа должна применить скидку к каждому товару и добавить в список элемент с новой ценой. В конце вывести таблицу с новой ценой.\n",
    "\n",
    "***Данные:***\n",
    "\n",
    "products = [[\"Laptop\", 1200], [\"Mouse\", 25], [\"Keyboard\", 75], [\"Monitor\", 200]]\n",
    "\n",
    "***Пример вывода:***\n",
    "\n",
    "Введите скидку (в процентах): 17\n",
    "\n",
    "Товар          Старая цена    Новая цена\n",
    "\n",
    "Laptop            1200.00$       996.00$\n",
    "\n",
    "Mouse                25.00$          20.75$\n",
    "\n",
    "Keyboard           75.00$          62.25$\n",
    "\n",
    "Monitor             200.00$        166.00$"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3",
   "metadata": {},
   "outputs": [],
   "source": [
    "products = [[\"Laptop\", 1200], [\"Mouse\", 25], [\"Keyboard\", 75], [\"Monitor\", 200]]\n",
    "\n",
    "print(products)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python (.venv)",
   "language": "python",
   "name": ".venv"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
