{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "0",
   "metadata": {},
   "source": [
    "#### 1. Реверс словаря\n",
    "\n",
    "Напишите программу, которая меняет местами ключи и значения в словаре. Если значения повторяются, добавьте их ключи в список.\n",
    "\n",
    "Данные:\n",
    "\n",
    "`data = {\"a\": 1, \"b\": 2, \"c\": 1, \"d\": 3}`\n",
    "\n",
    "* Пример вывода:\n",
    "\n",
    "Перевернутый словарь: {1: ['a', 'c'], 2: ['b'], 3: ['d']}"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1",
   "metadata": {},
   "source": [
    "#### 1. Способ"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2",
   "metadata": {},
   "outputs": [],
   "source": [
    "data = {\"a\": 1, \"b\": 2, \"c\": 1, \"d\": 3}\n",
    "result = {}\n",
    "\n",
    "for key, value in data.items():\n",
    "\n",
    "    result.setdefault(value, []).append(key)\n",
    "\n",
    "print('Перевернутый словарь:', result)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3",
   "metadata": {},
   "source": [
    "#### 2. Способ"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4",
   "metadata": {},
   "outputs": [],
   "source": [
    "data = {\"a\": 1, \"b\": 2, \"c\": 1, \"d\": 3}\n",
    "result = {}\n",
    "\n",
    "for key, value in data.items():  # [2]\n",
    "    if value in result:  # Проверяем, есть ли уже такой ключ в новом словаре [1]\n",
    "        result[value].append(key)  # Если есть, добавляем старый ключ в список [3]\n",
    "    else:\n",
    "        result[value] = [key]  # Если нет, создаем новый список с этим ключом [4]\n",
    "print('Перевернутый словарь:', result)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5",
   "metadata": {},
   "source": [
    "#### 2. Распределение студентов по группам\n",
    "У вас есть словарь, где ключи — имена студентов, а значения — их баллы за экзамен.\n",
    "Необходимо распределить студентов по группам:\n",
    "\n",
    "* \"Отличники\": баллы >= 85\n",
    "* \"Хорошисты\": баллы от 70 до 84\n",
    "* \"Троечники\": баллы от 50 до 69\n",
    "* \"Не сдали\": баллы < 50\n",
    "\n",
    "Создайте словарь с ключами-группами и количеством студентов в группе в качестве значений.\n",
    "\n",
    "Данные:\n",
    "\n",
    "`students = {\"Аня\": 92, \"Боря\": 76, \"Ваня\": 65, \"Галя\": 48, \"Дима\": 88, \"Ева\": 54}`\n",
    "\n",
    "`groups = [\"Отличники\", \"Хорошисты\", \"Троечники\", \"Не сдали\"]`\n",
    "\n",
    "\n",
    "Пример вывода:\n",
    "\n",
    "Распределение по группам:\n",
    "\n",
    "{'Отличники': 2, 'Хорошисты': 1, 'Троечники': 2, 'Не сдали': 1}"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6",
   "metadata": {},
   "source": [
    "#### 1. Способ"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7",
   "metadata": {},
   "outputs": [],
   "source": [
    "students = {\"Аня\": 92, \"Боря\": 76, \"Ваня\": 65, \"Галя\": 48, \"Дима\": 88, \"Ева\": 54}\n",
    "groups = [\"Отличники\", \"Хорошисты\", \"Троечники\", \"Не сдали\"]\n",
    "\n",
    "print(\"Распределение по группам:\")\n",
    "key_grope_cnt = {}\n",
    "for n in groups:\n",
    "    key_grope_cnt[n] = key_grope_cnt.setdefault(n, 0)\n",
    "for value in students.values():\n",
    "    if value >= 85:\n",
    "        key_grope_cnt[\"Отличники\"] += 1\n",
    "    elif value >= 70:\n",
    "        key_grope_cnt[\"Хорошисты\"] += 1\n",
    "    elif value >= 50:\n",
    "        key_grope_cnt[\"Троечники\"] += 1\n",
    "    else:\n",
    "        key_grope_cnt[\"Не сдали\"] += 1\n",
    "print(key_grope_cnt)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8",
   "metadata": {},
   "source": [
    "#### 2. Способ"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9",
   "metadata": {},
   "outputs": [],
   "source": [
    "students = {\"Аня\": 92, \"Боря\": 76, \"Ваня\": 65, \"Галя\": 48, \"Дима\": 88, \"Ева\": 54}\n",
    "groups = [\"Отличники\", \"Хорошисты\", \"Троечники\", \"Не сдали\"]\n",
    "print(\"Распределение по группам:\")\n",
    "key_grope_cnt = dict.fromkeys(groups, 0)\n",
    "for value in students.values():\n",
    "    if value >= 85:\n",
    "        key_grope_cnt[\"Отличники\"] += 1\n",
    "    elif value >= 70:\n",
    "        key_grope_cnt[\"Хорошисты\"] += 1\n",
    "    elif value >= 50:\n",
    "        key_grope_cnt[\"Троечники\"] += 1\n",
    "    else:\n",
    "        key_grope_cnt[\"Не сдали\"] += 1\n",
    "print(key_grope_cnt)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
