{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "c6d488cc",
   "metadata": {},
   "source": [
    "### 1. Сумма цифр числа\n",
    "Напишите программу, которая вычисляет сумму цифр введённого числа.\n",
    "Подсказка: последнюю цифру числа можно найти с помощью остатка от деления на 10 (num % 10), а удалить ее из числа можно с помощью деления на 10 нацело (num // 10).\n",
    "\n",
    "Пример вывода:\n",
    "* Введите число: 12345\n",
    "* Сумма цифр: 15"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b3d14d81",
   "metadata": {},
   "outputs": [],
   "source": [
    "num = int(input('Введите число:'))\n",
    "s = 0\n",
    "while num > 0:\n",
    "    d = num % 10\n",
    "    num = num // 10\n",
    "    s += d\n",
    "print('Сумма цифр:', s)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a067342f",
   "metadata": {},
   "source": [
    "### 2. Палиндром\n",
    "\n",
    "Напишите программу, которая запрашивает у пользователя целое число и определяет, является ли оно палиндромом. Число является палиндромом, если оно читается одинаково слева направо и справа налево.\n",
    "\n",
    "Пример вывода:\n",
    "\n",
    "* Введите число: 12321\n",
    "* Число 12321 является палиндромом.\n",
    "\n",
    "* Введите число: 1234\n",
    "* Число 1234 не является палиндромом."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6015e7b7",
   "metadata": {},
   "outputs": [],
   "source": [
    "user_num = abs(int(input('Введите число:')))\n",
    "num = user_num\n",
    "revers = 0\n",
    "while num > 0:\n",
    "    d = num % 10\n",
    "    num = num // 10\n",
    "    revers = revers * 10 + d\n",
    "if user_num == revers:\n",
    "    print('Число ', user_num, 'является палиндромом.')\n",
    "else:\n",
    "    print('Число ', user_num, 'не является палиндромом.')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "53472d40",
   "metadata": {},
   "source": [
    "### 3. Проверь интуицию\n",
    "\n",
    "Напишите программу, которая генерирует случайное число от 1 до 100 включительно и дает пользователю 10 попыток, чтобы угадать это число. Программа должна подсказывать, больше или меньше загаданное число. После завершения игры программа оценивает, насколько хорошая интуиция у игрока.\n",
    "\n",
    "Пример вывода:\n",
    "\n",
    "* Угадайте число от 1 до 100. У вас 10 попыток.\n",
    "* Ваше предположение: 50\n",
    "* Загаданное число меньше вашего\n",
    "* Ваше предположение: 25\n",
    "* Загаданное число больше вашего\n",
    "* Ваше предположение: 30\n",
    "Поздравляем! Вы угадали число: 30.\n",
    "\n",
    "Вы угадали число за 3 попытки. Отличный результат!\n",
    "\n",
    "* Угадайте число от 1 до 100. У вас 10 попыток.\n",
    "* Ваше предположение: 2\n",
    "Поздравляем! Вы угадали число: 2 за 1 попыток. Отличный результат!\n",
    "Отличная интуиция! Вы угадали с первой попытки!\n",
    "print(rnd_num, count)\n",
    "print('Вы использовали', count,'попыток.\\n Загаданное число -', rnd_num)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "0da4a70a",
   "metadata": {},
   "outputs": [],
   "source": [
    "import random\n",
    "\n",
    "count = 0\n",
    "rnd_num = random.randint(1, 100)\n",
    "while count < 10:\n",
    "    count += 1\n",
    "    print(rnd_num, count)\n",
    "    user_num = abs(int(input('Угадайте число от 1 до 100. У вас 10 попыток.')))\n",
    "    if user_num == rnd_num and count == 1:\n",
    "        print('Ваше предположение:', user_num, '\\n Поздравляем! Вы угадали число:', rnd_num, 'за', count , 'попыток. Отличный результат!\\n Отличная интуиция! Вы угадали с первой попытки!')\n",
    "        break\n",
    "    elif user_num == rnd_num and count > 1:\n",
    "        print('Ваше предположение:', user_num, '\\n Поздравляем! Вы угадали число:', rnd_num, '.\\n Вы угадали число за', count , 'попытки. Отличный результат!')\n",
    "        print('Вы использовали', count,'попыток.\\n Загаданное число -', rnd_num)\n",
    "        break\n",
    "    elif user_num < rnd_num:\n",
    "        print('Ваше предположение:', user_num,'\\n' , 'Загаданное число больше вашего')\n",
    "    else:\n",
    "        print('Ваше предположение:', user_num,'\\n' , 'Загаданное число меньше вашего')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
