{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "0",
   "metadata": {},
   "source": [
    "1. Одно слово\n",
    "\n",
    "Напишите программу, которая обрабатывает список из строк и удаляет все строки, содержащие более одного слова, а также преобразует оставшиеся строки к нижнему регистру.\n",
    "\n",
    "***Данные:***\n",
    "\n",
    "text_list = [\"Hello\", \"Python Programming\", \"World\", \"Advanced Topics\", \"Simple\"]\n",
    "\n",
    "***Пример вывода:***\n",
    "\n",
    "Обработанный список: ['hello', 'world', 'simple']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1",
   "metadata": {},
   "outputs": [],
   "source": [
    "text_list = [\"Hello\", \"Python Programming\", \"World\", \"Advanced Topics\", \"Simple\"]\n",
    "for i in range(len(text_list) - 1, -1, -1):\n",
    "    if \" \" not in text_list[i]:\n",
    "        text_list[i] = text_list[i].lower()\n",
    "    else:\n",
    "        del text_list[i]\n",
    "print(\"Обработанный список:\",text_list)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2",
   "metadata": {},
   "source": [
    "2. Обновление цен товаров\n",
    "\n",
    "Дан список товаров с ценами. Программа должна применить скидку к каждому товару и добавить в список элемент с новой ценой. В конце вывести таблицу с новой ценой.\n",
    "\n",
    "***Данные:***\n",
    "\n",
    "`products = [[\"Laptop\", 1200], [\"Mouse\", 25], [\"Keyboard\", 75], [\"Monitor\", 200]]`\n",
    "\n",
    "***Пример вывода:***\n",
    "\n",
    "Введите скидку (в процентах): 17\n",
    "\n",
    "`Товар          Старая цена    Новая цена`\n",
    "\n",
    "`Laptop            1200.00$       996.00$`\n",
    "\n",
    "`Mouse               25.00$        20.75$`\n",
    "\n",
    "`Keyboard            75.00$        62.25$`\n",
    "\n",
    "`Monitor            200.00$       166.00$`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3",
   "metadata": {},
   "outputs": [],
   "source": [
    "head = ['Товар', 'Старая цена', 'Новая цена']\n",
    "products = [[\"Laptop\", 1200], [\"Mouse\", 25], [\"Keyboard\", 75], [\"Monitor\", 200]]\n",
    "discount = int(input(\"Введите скидку (в процентах):\"))\n",
    "print(f\"\\n{head[0]:<12} {head[1]:>14} {head[2]:>14}\")\n",
    "for row in products:\n",
    "    new_price = row[1] * (1 - discount / 100)\n",
    "    row.append(new_price)\n",
    "    print(f\"{row[0]:<12} {row[1]:>13.2f}$ {row[2]:>13.2f}$\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python (.venv)",
   "language": "python",
   "name": ".venv"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
